app/views/books/_form.html.erb

SELECT "reading_lists".* FROM "reading_lists"
---
      <br />
      <%= f.collection_select(:reading_list_id, ReadingList.all, :id, :name, prompt: true ) %>