app/views/books/show.html.erb

      <% if @book.reviews != [] %>
        <% @book.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]