app/controllers/books_controller.rb

  def create
    Book.create(book_params[:book])
---
INSERT INTO "books" ("title", "author", "genre", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Rogue Lawyer"], ["author", "John Grisham"], ["genre", ""], ["rating", 0], ["created_at", "2015-12-30 03:53:52.062779"], ["updated_at", "2015-12-30 03:53:52.062779"]]

  def edit
    id = params[:id]
    @book = Book.find(id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 14]]

  def show
    id = params[:id]
    @book = Book.find(id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]

  def update
    id = params[:id]
    @book = Book.find(id)
      @book.update(
        title: book_params[:book][:title],
        author: book_params[:book][:author],
        read_status: params[:read_status],
        genre: book_params[:book][:genre],
        rating: book_params[:book][:rating],
        reading_list_id: book_params[:book][:reading_list_id]
        )
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 14]]
UPDATE "books" SET "image_url" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["image_url", "http://books.google.com/books/content?id=wIAnG6M2dKMC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api"], ["updated_at", "2015-12-30 04:24:15.712495"], ["id", 2]]

  def destroy
    id = params[:id]
    Book.destroy(id)
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]