app/controllers/reading_lists_controller.rb

  def index
    @reading_lists = ReadingList.all
---
SELECT "reading_lists".* FROM "reading_lists"

  def create
    ReadingList.create(reading_list_params[:reading_list])
---
INSERT INTO "reading_lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "wejifwoejfkaofjisopfjeipoawfasfe"], ["created_at", "2015-12-30 04:02:20.797877"], ["updated_at", "2015-12-30 04:02:20.797877"]]

  def edit
    id = params[:id]
    @reading_list = ReadingList.find(id)
---
SELECT  "reading_lists".* FROM "reading_lists" WHERE "reading_lists"."id" = ? LIMIT 1  [["id", 1]]

  def show
    id = params[:id]
    @reading_list = ReadingList.find(id)
---
SELECT  "reading_lists".* FROM "reading_lists" WHERE "reading_lists"."id" = ? LIMIT 1  [["id", 1]]

  def update
    id = params[:id]
    @reading_list = ReadingList.find(id)
    @reading_list.update(
      name: reading_list_params[:reading_list][:name]
      )
---
SELECT  "reading_lists".* FROM "reading_lists" WHERE "reading_lists"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "reading_lists" SET "name" = ?, "updated_at" = ? WHERE "reading_lists"."id" = ?  [["name", "oceanography"], ["updated_at", "2015-12-30 22:57:33.641762"], ["id", 1]]

  def destroy
    id = params[:id]
    ReadingList.destroy(id)
---
DELETE FROM "reading_lists" WHERE "reading_lists"."id" = ?  [["id", 1]]