app/controllers/reviews_controller.rb

  def create
    @book = Book.find(params["book_id"])
    review = Review.create(body: review_params[:review][:body], reviewer: review_params[:review][:reviewer], book_id: @book.id )
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("body", "reviewer", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def new
    @review = Review.new
    @book = Book.find(params["book_id"])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]